# PostgreSQL

## SQL SELECT Statements

#### Select all rows and columns from table tbl
```SQL
SELECT * FROM tbl;
```

#### Select columns 1 and 2 and limit number of rows from table tbl
```SQL
SELECT col1,col2 FROM tbl
LIMIT number;
```

#### Select distinct rows by columns 1 and 2
```SQL
SELECT DISTINCT col1,col2 FROM tbl;
```

#### Count number of (distinct) rows from table tbl
```SQL
SELECT COUNT(*) FROM tbl;
SELECT COUNT(DISTINCT col1) FROM tbl;
```

#### WHERE
```SQL
SELECT col1,col2 FROM tbl
WHERE conditions
ORDER BY col1 ASC, col2 DESC;
```

#### Ordering in ascending or descending order
```SQL
SELECT col1,col2 FROM tbl
WHERE conditions
ORDER BY col1 ASC, col2 DESC;
```

#### BETWEEN, IN, LIKE
```SQL
WHERE col1 NOT BETWEEN low and high
WHERE col1 NOT IN (list or tbl)
WHERE col1 NOT LIKE '_abcd%'
WHERE col1 NOT ILIKE '_abcd%' #not case sensitive
```
note: ILIKE is PostgreSQL syntax

#### Aggregate functions
```SQL
SELECT aggfunc(col1) FROM tbl;
SUM(),MIN(),MAX(),AVG(),COUNT()
ROUND(aggfunc/col,number of decimals)
```
note: so many other functions in documentation

#### GROUP BY
```SQL
SELECT col1, COUNT(*) FROM tbl
GROUP BY col1;

SELECT col1, SUM(col1) FROM tbl
GROUP BY col1;

SELECT col1,agg_func(col2) FROM tbl
GROUP BY col1;
```

#### HAVING
```SQL
SELECT col1,agg_func(col2) FROM tbl
WHERE col1>a
GROUP BY col1
HAVING agg_func(col2)<b;
```
note: WHERE before GROUP BY. HAVING after GROUP BY.

#### Mathematical Functions
Example:
```SQL
SELECT abs(col1+col2), col1^col2 FROM tbl;
```
note: many math funcs. google 'PostgreSQL math'

#### String Functions
Example:
```SQL
SELECT col1 || '.' || col2 FROM tbl;
```
note: many string funcs. google 'PostgreSQL string functions'

#### AS
```SQL
SELECT *, col1+col2 AS sum_of_columns FROM tbl;
```
note: AS to specify a column alias\
note: AS can be eliminated. Replaced with a single space

#### Timestamps
col1 is a Timestamp type. Example:
```SQL
SELECT extract(day from col1) FROM tbl;
```
note: many Timestamps funcs. google 'PostgreSQL datetime'

#### SubQuery
Query in parentheses. Example:
```SQL
(SELECT AVG(col1) FROM tbl)
```
note: subquery in FROM must have an alias

------

## SQL JOIN Statements

#### JOIN
```SQL
SELECT A.pka, A.col1, B.pkb, B.col2
FROM A
INNER JOIN B ON A.pka=B.fka;

```
Types:
* (INNER) JOIN
* LEFT (OUTER) JOIN
* RIGHT (OUTER) JOIN
* FULL OUTER JOIN

Terms in parentheses not necessary.

LEFT OUTER and RIGHT OUTER with WHERE:
```SQL
SELECT * FROM A
LEFT JOIN B ON A.key=B.key
WHERE B.key IS NULL;

```

#### UNION / UNION ALL
```SQL
SELECT col1,col2 FROM tbl_1
UNION
SELECT col1,col2 FROM tbl_2;
```
note: UNION deletes duplicate rows. UNION ALL for all rows including duplicates.

#### Self Join
```SQL
SELECT A.col1, A.col2, B.col1, B.col2
FROM tbl AS A
JOIN tbl AS B ON A.col1=B.col2;

```

-------

## Creating and Modifying Table

#### CREATE
```SQL
CREATE TABLE table_name (
    column_name data_type PRIMARY KEY,
    column_name data_type column_constraint,
    column_name data_type [CONSTRAINT constraint_name] column_constraint,
    ...,
    table_constraint)
    INHERITS existing_table;
```

PostgreSQL Create Copy:
```SQL
CREATE TABLE new_tbl (LIKE tbl);
```

**PRIMARY KEY**: uniqly defines each rows
* One PK per Table

**FOREIGN KEY**: refers to a PK in another table
* multiple FK per Table

FK Constraint maintain ***referential integrity*** between parent and child tables.

#### Common Data Types
* bool
* characters: char(n), varchar(n)
* integers: smallint, int, serial(AUTO_INCREMENT)
* floats: float(n), real, numeric(p,n)
* Temporal: date, time, timestamp

#### SQL *Column* Constraints
* NOT NULL
* UNIQUE
* CHECK(condition)

#### SQL *Table* Constraints
* UNIQUE(column_list)
* PRIMARY_KEY(column_list)
* CHECK(column_list)
* References

#### INSERT
```SQL
INSERT INTO tbl (col1,col2,..)
VALUES (val1,val2,..),
       (val1,val2,..),
       (val1,val2,..),
       ...;
```
From another table:

```SQL
INSERT INTO tbl
SELECT col1,col2 FROM another_tbl
WHERE conditions;
```

#### UPDATE
```SQL
UPDATE tbl
SET col1= val1,
    col2= val2, ... 
WHERE conditions
RETURNING col1, col2, ... ;
    
```

#### DELETE 
For deleting rows:
```SQL
DELETE FROM tbl 
WHERE conditions
RETURNING col1, col2, ... ;
    
```

#### ALTER TABLE
```SQL
ALTER TABLE tbl action;    
```
Action keywords:
```SQL
RENAME TO new_name_tbl
RENAME COLUMN col1 TO new_name_col1
ADD COLUMN col1 data_type col1_constraint
DROP COLUMN col1
ALTER COLUMN col1 TYPE data_type
ADD CONSTRAINT constraint_name constraint;
```

#### DROP TABLE
```SQL
DROP TABLE [IF EXISTS] tbl [RESTRICT/CASCADE];  
```

#### VIEW
```SQL
CREATE VIEW view_name query;
ALTER VIEW view_name action;
DROP VIEW view_name;
```

--------

## postgreSQL with Python (psycopg2)

#### Importing psycopg2

In [1]:
import psycopg2 as pg

#### First Example:

In [120]:
conn = pg.connect("dbname=emp user=postgres host='localhost' password='pgadmin4'")

In [121]:
cur = conn.cursor()

In [137]:
cur.execute('SELECT * FROM link')

In [138]:
cur.fetchall()

[(2, 'www.instagram.com', 'Social Media', 'US', None),
 (3, 'www.REWE.com', 'Super Market', 'DE', None),
 (8, 'www.lidl.com', 'super', 'US', None)]

In [124]:
cur.execute("INSERT INTO link VALUES(%s,%s,%s)",(9,'www.amazon.de','DE') )

**With Pandas:**

In [143]:
import pandas as pd

In [144]:
pd.read_sql('SELECT * FROM link',conn)

   id                url   description country_code  name
0   2  www.instagram.com  Social Media           US  None
1   3       www.REWE.com  Super Market           DE  None
2   8       www.lidl.com         super           US  None

#### Second Example:

In [ ]:
namedict = ({"first_name":"Joshua", "last_name":"Drake"},
            {"first_name":"Steven", "last_name":"Foo"},
            {"first_name":"David", "last_name":"Bar"})

In [115]:
cur.executemany("""INSERT INTO employees(first_name,last_name) 
                VALUES (%(first_name)s, %(last_name)s)""",
                namedict)

In [ ]:
cur.execute('SELECT * FROM employees')

In [118]:
cur.fetchall()

[(1, 'Dave', 'Johnson', None),
 (2, 'Sam', 'Daniel', None),
 (3, 'Nina', 'Tillerson', None),
 (4, 'Ana', 'Michigan', None),
 (5, 'Krystal', 'Andrews', 9),
 (6, 'Susannah', 'Villanueva', 10),
 (7, 'Jae', 'Garner', 11),
 (8, 'Tracey', 'Coates', 12),
 (9, 'Charlotte', 'Roman', None),
 (10, 'Ishaaq', 'Moody', None),
 (11, 'Rachel', 'Abbott', None),
 (12, 'Aamna', 'Moyer', None),
 (21, 'Joshua', 'Drake', None),
 (22, 'Steven', 'Foo', None),
 (23, 'David', 'Bar', None)]

## SQL MAGIC

#### postgreSQL SQL Magic

In [119]:
# pip install ipython-sql

In [151]:
%load_ext sql

In [ ]:
# %%sql postgresql://USER:PASSWORD@HOST:PORT/DATABASE_NAME

In [153]:
%sql postgresql://postgres:pgadmin4@localhost/emp

'Connected: postgres@emp'

In [154]:
%%sql
SELECT * FROM employees;

 * postgresql://postgres:***@localhost/emp
12 rows affected.

[(1, 'Dave', 'Johnson', None),
 (2, 'Sam', 'Daniel', None),
 (3, 'Nina', 'Tillerson', None),
 (4, 'Ana', 'Michigan', None),
 (5, 'Krystal', 'Andrews', 9),
 (6, 'Susannah', 'Villanueva', 10),
 (7, 'Jae', 'Garner', 11),
 (8, 'Tracey', 'Coates', 12),
 (9, 'Charlotte', 'Roman', None),
 (10, 'Ishaaq', 'Moody', None),
 (11, 'Rachel', 'Abbott', None),
 (12, 'Aamna', 'Moyer', None)]

In [155]:
my_tbl= %sql SELECT * FROM employees;

 * postgresql://postgres:***@localhost/emp
12 rows affected.

#### IBM SQL Magic

In [166]:
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
%sql ibm_db_sa://xdp85145:d3vc+fm0j59d0crw@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['postgresql://postgres:***@localhost/emp'])
Can't load plugin: sqlalchemy.dialects:ibm_db_sa
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['postgresql://postgres:***@localhost/emp'])

------------

### More to learn:
https://wiki.postgresql.org/wiki/Psycopg2_Tutorial \
http://initd.org/psycopg/docs/usage.html \
https://github.com/catherinedevlin/ipython-sql